//DGUS+ Russian translation
//新建
[NewDocumentForm]
groupBox2  =  "Свойства экрана"
label7  =  "Разрешение"
label4  =  "Цвет"
groupBox4  =  "Путь к файлам"
label6  =  "Примечание:"
label5  =  "Если в выбранной папке уже есть проект, он будет открыт."
Text  =  "Настройка свойств экрана"
btOk  =  "ОК"
btCancel  =  "Отмена"


//编辑区域
[cfg_DrawAreaForm]
toolStripMenuItem1  =  "Выровнять"
toolStripMenuItem2  =  "Размер"
toolStripMenuItem3  =  "Копировать     Ctrl+C"
toolStripMenuItem4  =  "Вставить    Ctrl+V"
toolStripMenuItem5  =  "Удалить   Del"
toolStripMenuItem6  =  "Отменить     Ctrl+Z"
toolStripMenuItem7  =  "На передний план"
toolStripMenuItem8  =  "На задний план"
toolStripMenuItem9=
toolStripMenuItem10  =  "Увеличить"
toolStripMenuItem11  =  "Уменьшить"
toolStripMenuItem12  =  "Выделить всё  Ctrl+A"
toolStripMenuItem13  =  "Выделить того же типа"
toolStripMenuItem14=
toolStripMenuItem15=
toolStripMenuItem16=
toolStripMenuItem17=
toolStripMenuItem18=
toolStripMenuItem19=
toolStripMenuItem20  =  "По левому краю"
toolStripMenuItem21  =  "По центру"
toolStripMenuItem22  =  "По правому краю"
toolStripMenuItem23  =  "По верхнему краю"
toolStripMenuItem24  =  "По середине"
toolStripMenuItem25  =  "По нижнему краю"
toolStripMenuItem26  =  "Одинаковая ширина"
toolStripMenuItem27  =  "Одинаковая высота"
toolStripMenuItem28  =  "Одинаковый размер"
toolStripMenuItem29=
toolStripMenuItem30=
toolStripMenuItem31=
toolStripMenuItem32=
toolStripMenuItem33=
toolStripMenuItem34=
toolStripMenuItem35=
toolStripMenuItem36=
toolStripMenuItem37=
toolStripMenuItem38=
toolStripMenuItem39=
toolStripMenuItem40=
toolStripMenuItem41=
toolStripMenuItem42=
toolStripMenuItem43=
toolStripMenuItem44=
toolStripMenuItem45=
toolStripMenuItem46=
toolStripMenuItem47=
toolStripMenuItem48=
toolStripMenuItem49=
toolStripMenuItem50=

//主菜单
[FormMain]
tabPage1  =  "Файл"
myButton1  =  "Создать"
myButton2  =  "Открыть"
myButton3  =  "Запись"
myButton4  =  "Запись как"
myButton5  =  "Сборка"
myButton6  =  "Закрыть"
myButton7  =  "Экспорт"
myButton8  =  "Импорт"
myButton126  =  "Сеть"
myButton127  =  "Стоп сети"
myButton131  =  "Правка языков"
myButton131Tip  =  "Если при нажатии ничего не происходит, откройте папку Font вручную и измените файл 2.xls."
btnFindVP  =  "Найти VP"
	  
tabPage13  =  "Основное"
myButton61  =  "Создать"
myButton65  =  "Запись"
myButton64  =  "Сборка"
myButton62  =  "Импорт"
myButton96  =  "Проверка"
myButton95  =  "Просмотр с текущей"
myButton94  =  "Просмотр с первой"
myButton98  =  "Экран"
myButton97  =  "UART DGUS"
myButton81  =  "Иконка VAR"
myButton80  =  "Анимация иконок"
myButton79  =  "Слайдер"
myButton78  =  "Цифры иконок"
myButton77  =  "Анимация картинок"
myButton76  =  "Вращение иконки"
myButton75  =  "Бит иконка"
myButton74  =  "Вывод данных"
myButton73  =  "Вывод текста"
myButton72  =  "Часы"
myButton71  =  "Время RTC"
myButton70  =  "Базовая графика"
myButton112  =  "Особые функции"
myButton68  =  "QR-код"
myButton67  =  "Бегущая зона"
myButton66  =  "Окно данных"
myButton107  =  "Кривая"
myButton93  =  "Ввод данных"
myButton92  =  "Меню"
myButton90  =  "Шаговая правка"
myButton82  =  "Правка тягой"
myButton91  =  "Касание"
myButton88  =  "Код клавиши"
myButton87  =  "Ввод ASCII"
myButton108  =  "Ввод GBK"
myButton89  =  "Параметр"
myButton86  =  "Возврат данных"
myButton85  =  "Правка поворотом"
myButton84  =  "Правка слайдом"
myButton83  =  "Листание"
myButton110  =  "Яркость"
myButton102  =  "Копия"
myButton101  =  "Вставить"
myButton100  =  "Удалить"
myButton104  =  "Вперёд"
myButton103  =  "Назад"
myButton99  =  "Отмена"

tabPage3  =  "Иконки"
myButton9  =  "Иконка VAR"
myButton10  =  "Анимация иконок"
myButton11  =  "Слайдер"
myButton12  =  "Цифры иконок"
myButton13  =  "Анимация картинок"
myButton14  =  "Вращение иконки"
myButton15  =  "Бит иконка"
myButton18  =  "Часы"
myButton21  =  "Перевод данных"
myButton115  =  "Текст DGUS II"
myButton116  =  "Переход иконок"
myButton118  =  "Слои иконок"
myButton119  =  "Пакет иконок"
myButton121  =  "GTF"
myButton123  =  "Видео"
btnKnob  =  "Ручка"

tabPage14  =  "Текст"
myButton16  =  "Вывод данных"
myButton17  =  "Вывод текста"
myButton19  =  "Время RTC"
myButton114  =  "HEX данные"
myButton113  =  "Бегущий текст"
myButton24  =  "Окно данных"
myButton120  =  "Бегущие символы"
myButton130  =  "Языки"

tabPage15  =  "Графика"
myButton105  =  "Кривая"
myButton20  =  "Базовая графика"
myButton23  =  "Бегущая зона"
myButton22  =  "QR-код"
myButton109  =  "Яркость"
myButton129  =  "Прогресс"

tabPage2  =  "Касание"
myButton25  =  "Ввод данных"
myButton26  =  "Меню"
myButton27  =  "Шаговая правка"
myButton28  =  "Правка тягой"
myButton29  =  "Касание"
myButton30  =  "Код клавиши"
myButton31  =  "Ввод ASCII"
myButton32  =  "Параметр"
myButton33  =  "Возврат данных"
myButton34  =  "Правка поворотом"
myButton35  =  "Правка слайдом"
myButton36  =  "Листание"
myButton117  =  "Выбор иконки"
myButton124  =  "Бит кнопка"
myButton106  =  "Ввод GBK"

tabPage4  =  "Правка"
myButton37  =  "По левому краю"
myButton38  =  "По центру"
myButton39  =  "По правому краю"
myButton40  =  "По верхнему краю"
myButton41  =  "По середине"
myButton42  =  "По нижнему краю"
myButton43  =  "Равный размер"
myButton44  =  "Равная ширина"
myButton45  =  "Равная высота"
myButton46  =  "Копия"
myButton47  =  "Вставить"
myButton48  =  "Удалить"
myButton49  =  "Отмена"
myButton52  =  "Вперёд"
myButton53  =  "Назад"
myButton125  =  "Массив"

tabPage6  =  "Настройки"
myButton57  =  "Экран"
myButton58  =  "COM DGUS"
myButton128  =  "Портрет"

tabPage5  =  "Просмотр"
myButton54  =  "Проверка VP"
myButton55  =  "Просмотр с текущей"
myButton56  =  "Просмотр с первой"
btnDebug  =  "Отладка"

string_1  =  "Сохраните файл, иначе изменения могут быть потеряны."
string_2  =  "Напоминание"
string_3  =  "Создать новый или открыть существующий"


//列表
[DummyTaskList]
toolStripButton5  =  "Добавить"
toolStripButton5_ToolTipText  =  "Добавить"
toolStripDropDownButton2  =  "Удалить"
删除ToolStripMenuItem  =  "Удалить выбранное"
删除ToolStripMenuItem_ToolTipText  =  "Удалить выбранное"
删除所有ToolStripMenuItem  =  "Удалить всё"
删除所有ToolStripMenuItem_ToolTipText  =  "Удалить всё"
toolStripButton6  =  "Вверх"
toolStripButton7  =  "Вниз"
Position  =  "Позиция"
Column1  =  "Файлы"

string_1  =  "Создать новый или открыть существующий"
string_2  =  "Если имя файла пустое или нажата «Отмена», текущий файл будет пропущен и проигнорирован в проекте."
string_3  =  "Переопределение файла"

toolStripButton3  =  "заменить"

//欢迎
[DGUS_Welcome]
linkLabel1  =  "Создать"
linkLabel2  =  "Открыть файл"
groupBox2  =  "Управление проектом"
linkLabel12  =  "История"
groupBox3  =  "Инструменты настройки DGUS"
linkLabel6  =  "Загрузка по UART"
linkLabel10  =  "Преобразование картинок"
linkLabel3  =  "Генерация DWIN ICL"
linkLabel4  =  "Библиотека шрифта №0"
linkLabel5  =  "Знаете ли вы?"
groupBox1  =  "Справка"
linkLabel9  =  "Горячая линия: (86)400-018-9008"
linkLabel7  =  "www.dwin-global.com"
groupBox5  =  "Заданные параметры"
label1  =  "Максимум переменных на страницу"
label8  =  "Режим отображения иконок"
CK_AutoData  =  "Автозагрузка данных"
groupBox4  =  "Шрифт"
label3  =  "Цвет шрифта"
label15  =  "ID шрифта"
label11  =  "Размер шрифта"
TabText  =  "Добро пожаловать"

label4  =  "Версия ОС"
linkLabel14  =  "Генератор конфигурации"
linkLabel13  =  "Генератор WAE"
linkLabel15  =  "Генератор серых шрифтов"
linkLabel16  =  "Сетевой обмен"
link_Keyboard  =  "Клавиатура"
link_RoleChar  =  "Прокрутка символов"
link_DGUS_Font  =  "Шрифт DGUS"
link_multiLanguage  =  "Мультиязычность"
link_av  =  "Видео-инструмент"
link_modbus  =  "Инструмент Modbus"
comboBox3_item0  =  "Ниже V21"
comboBox3_item1  =  "V21 и выше"
comboBox1_item0  =  "прозрачный"
comboBox1_item1  =  "показывать фон"
label2  =  "【Библиотека шрифта №0】: создаёт профиль шрифта №0 для DWIN DGUS. Шрифт №0 содержит матричные шрифты разных размеров: от 4*8 до 64*128"
label7  =  "ID библиотеки"
label9  =  "выравнивание"
btnRotaryKnobSetting  =  "Настр. энкодера"

[DGUS_Design]
TabText  =  "Касания и отображение"

[Btn_PropertyFrom]
label2  =  "Элементы"
ComboBox1String_1  =  "Все"
ComboBox1String_2  =  "Только элементы касания"
ComboBox1String_3  =  "Только элементы отображения"
checkBox3  =  "RGB-значение картинки"
checkBox1  =  "показ подписей"
groupBox1  =  "Быстрая настройка"
button1  =  "ОК"
label3  =  "Количество элементов"
label1  =  "Шаг адреса переменной"
groupBox3  =  "Групповая настройка"
button7  =  "Настройка слайдера"
button6  =  "Настройка RTC"
button4  =  "Ввод текста"
button3  =  "Ввод данных"
button8  =  "Изменить ID голоса"
groupBox2  =  "Сетка"
label8  =  "Цвет сетки"
label7  =  "Плотность сетки"
label6  =  "Смещение по Y"
label5  =  "Смещение по X"
checkBox2  =  "Показывать сетку"
groupBox4  =  "Быстрые действия"
button5  =  "Свойства"
label9  =  "Массовый выбор:"
ComboBox2String_1  =  "Ввод данных переменной"
ComboBox2String_2  =  "Всплывающее меню"
ComboBox2String_3  =  "Пошаговая регулировка"
ComboBox2String_4  =  "Регулировка перетаскиванием"
ComboBox2String_5  =  "Условие регулировки слайдером"
ComboBox2String_6  =  "Базовое касание"
ComboBox2String_7  =  "Возврат данных"
ComboBox2String_8  =  "Ввод текста"
ComboBox2String_9  =  "Листание страниц"
ComboBox2String_10  =  "Иконка переменной"
ComboBox2String_11  =  "Анимация иконок"
ComboBox2String_12  =  "Индикация слайдера"
ComboBox2String_13  =  "Художественная переменная"
ComboBox2String_14  =  "Анимация картинок"
ComboBox2String_15  =  "Индикация вращения иконки"
ComboBox2String_16  =  "Иконка битовой переменной"
ComboBox2String_17  =  "Отображение данных"
ComboBox2String_18  =  "Отображение текста"
ComboBox2String_19  =  "Стрелочные часы"
ComboBox2String_20  =  "Текстовое время RTC"
ComboBox2String_21  =  "Окно данных"
ComboBox2String_22  =  "Бегущая зона"
ComboBox2String_23  =  "QR-код"
ComboBox2String_24  =  "Подсветка зоны"
ComboBox2String_25  =  "Текст DGUS II"
button2  =  "Выбрать все"
TabText  =  "Свойства"
string_1  =  "Выберите одну или несколько кнопок одного типа"
string_2  =  "Нельзя изменять кнопки разных типов"
string_3  =  "Массовая настройка недоступна"
label11  =  "Значение"
button9  =  "Увеличить всё"
button10  =  "Уменьшить всё"
strInfo  =  "После нажатия адреса переменных всех элементов станут равны исходному адресу плюс поправка (кроме адреса 0). При нажатии «Отмена» изменений не будет!"
strInfo2  =  "После нажатия адреса переменных всех элементов станут равны исходному адресу минус поправка (кроме адреса, уменьшенного до 0). При нажатии «Отмена» изменений не будет!"
checkBox4  =  "Блокировать"
checkBox5  =  "Разблок."
myGroupBox1  =  "Изменение VP"
btnAddSelect  =  "добавить в выбор"
btnSubSelect  =  "убрать из выбора"


//图标变量
[ICOvariableForm]
label9  =  "SP (0x)"
label16  =  "Имя"
label8  =  "Режим отображения"
label7  =  "Файл иконок"
label5  =  "ID иконки"
label6  =  "ID иконки"
label4  =  "Максимум"
label3  =  "Минимум"
label2  =  "VP (0x)"
label19  =  "Начальное значение"
Text  =  "Иконка переменной"
comboBox1String_1  =  "Прозрачный"
comboBox1String_2  =  "Показывать фон"

label10  =  "Режим прозрачности фона"
label13  =  "Яркость фона"
label14  =  "Яркость иконки"
label15  =  "Фильтр"
cb2_item0  =  "Наложение"
cb2_item1  =  "Наложение 1"
cb2_item2  =  "Наложение 2"
cbox_popshow  =  "показывать во всплывающем меню"
cboxGroupEnable  =  "включить группу"
label11  =  "ID группы"
label12  =  "шаг группы"

//动画图标显示  
[Anim_DisICOForm]
comboBox1String_1  =  "Прозрачный"
comboBox1String_2  =  "Показывать фон"
label16  =  "Имя"
label8  =  "Режим отображения"
label7  =  "Файл иконок"
label4  =  "Начальное значение"
label3  =  "Конечное значение"
label2  =  "VP (0x)"
label1  =  "SP (0x)"
label9  =  "ID конечной иконки"
label5  =  "ID начальной иконки"
label6  =  "ID конечной иконки"
label10  =  "Начальное значение"
Text  =  "Анимация иконок"

label12  =  "Время одной иконки (в циклах DGUS)"
label11  =  "Режим прозрачности фона"
label13  =  "Яркость фона"
label15  =  "Яркость иконки"
label14  =  "Режим анимации"
label17  =  "Фильтр"
label18  =  "Конечная иконка"
cb2_item0  =  "Наложение"
cb2_item1  =  "Наложение 1"
cb2_item2  =  "Наложение 2"
cb3_item0  =  "Циклично"
cb3_item1  =  "Однократно"
cb4_item0  =  "Без сброса"
cb4_item1  =  "Сброс"
cb4_item2  =  "Текущая иконка"



//Sliding scale指示设置
[SliderSetForm]
label10  =  "Конечное значение"
LableA  =  "Начальное и конечное значения система оставит областью управления по умолчанию"
label13  =  "Тип переменной"
label6  =  "Смещение по (X)"
label4  =  "Координата Y"
label8  =  "Режим отображения"
label7  =  "Файл иконок"
label5  =  "Иконка слайдера"
label14  =  "SP (0x)"
label9  =  "Конечное значение"
label16  =  "Имя"
label3  =  "Начальное значение"
label2  =  "VP (0x)"
label15  =  "Начальное значение"
label12  =  "Режим слайдера"
Text  =  "Слайдер"
comboBox1String_1  =  "Прозрачный"
comboBox1String_2  =  "Показывать фон"
comboBox2String_1  =  "Горизонтально"
comboBox2String_2  =  "Вертикально"
comboBox3String_1  =  "Слово"
comboBox3String_2  =  "Старший байт"
comboBox3String_3  =  "Младший байт"
String_1  =  "Координата Y"
String_2  =  "Смещение по (X)"
String_3  =  "Координата X"
String_4  =  "Смещение по (Y)"

label18  =  "Режим прозрачности фона"
label17  =  "Яркость фона"
label19  =  "Яркость иконки"
label20  =  "Фильтр"
cb4_item0  =  "Наложение"
cb4_item1  =  "Наложение 1"
cb4_item2  =  "Наложение 2"

//艺术字变量显示
[ArtTextSetForm]
label9  =  "ID иконки для цифры 0; порядок: 0123456789-."
label1  =  "Выравнивание"
label13  =  "Тип переменной"
label6  =  "Целых разрядов"
label8  =  "Режим отображения"
label5  =  "Дробных разрядов"
label11  =  "Начальная иконка"
label12  =  "Имя"
label14  =  "Файл иконок"
label15  =  "VP (0x)"
label17  =  "SP (0x)"
label10  =  "Начальное значение"
TabText  =  "Художественная переменная"
label3  =  "Режим прозрачности фона"
label2  =  "Яркость фона"
label4  =  "Яркость иконки"
label7  =  "Фильтр"
checkBox_show0  =  "Показывать ли незначащий 0"

comboBox1String_1  =  "Прозрачный"
comboBox1String_2  =  "Показывать фон"
comboBox3String_1  =  "int (2 байта)"
comboBox3String_2  =  "Long int (4 байта)"
comboBox3String_3  =  "*VP, старший байт"
comboBox3String_4  =  "*VP, младший байт"
comboBox3String_5  =  "Сверхдлинное int (8 байт)"
comboBox3String_6  =  "Беззнаковое int (2 байта)"
comboBox3String_7  =  "Беззнаковое long int (4 байта)"
comboBox3String_8  =  "float（4 байта）"
comboBox3String_9  =  "double（8 байт）"
comboBox2String_1  =  "Слева"
comboBox2String_2  =  "Справа"
comboBox2String_3  =  "По центру"
cb4_item0  =  "Наложение"
cb4_item1  =  "Наложение 1"
cb4_item2  =  "Наложение 2"

//图片动画显示
[ImgAnimate]
label2  =  "SP (0x)"
label3  =  "Настройка RTC"
label6  =  "ID начальной картинки"
label5  =  "ID конечной картинки"
label16  =  "Имя"
TabText  =  "Анимация картинок"
button5  =  "задать"
label7  =  "ID библиотеки icl"
label19  =  "ID конечной картинки"
myGroupBox1  =  "ID библиотеки icl (0x00: значение из файла cfg)"
//图标旋转指示
[ICONRotate]
label6  =  "Центр вращения — координата левого верхнего угла кнопки настройки"
label17  =  "Угол поворота, 0-720 (0x000-0x2D0), единица: 0,5°"
button2  =  "Демонстрация вращения"
label13  =  "Конечный угол"
label14  =  "Начальный угол"
label9  =  "Конечная переменная"
label12  =  "Начальная  переменная"
label2  =  "VP (0x)"
label15  =  "SP (0x)"
label4  =  "ID иконки"
label7  =  "Файл иконок"
label16  =  "Имя"
label19  =  "Начальное значение"
TabText  =  "Индикация вращения иконки"
label3  =  "Центр вращения иконки:"
label8  =  "Режим отображения"
label5  =  "Фильтр"

comboBox1String_1  =  "Прозрачный"
comboBox1String_2  =  "Показывать фон"
comboBox2String_1  =  "Int"
comboBox2String_2  =  "старший байт"
comboBox2String_3  =  "младший байт"

//位变量图标显示
[bitIconForm]
button3  =  "Настройка"
label15  =  "Режим отображения"
label14  =  "Интервал"
label11  =  "Режим перемещения"
label8  =  "Режим отображения"
label7  =  "Файл иконок"
label10  =  "AP(0x)"
label16  =  "Имя"
label2  =  "VP (0x)"
label1  =  "SP (0x)"
label4  =  "Начальное значение"
Text  =  "Битовая иконка"
label18  =  "Фильтр"
comboBox3String_1  =  "Прозрачный"
comboBox3String_2  =  "Показывать фон"

//位控制设置
[ActBitSetForm]
button1  =  "ОК"
button2  =  "Отмена"
Text  =  "Настройка битового элемента"

//数据变量显示"
[DataVarForm]
label14  =  "Строка единиц измерения, код ASCII"
label3  =  "Показывать единицы"
label13  =  "Дробных разрядов"
label9  =  "Целых разрядов"
label12  =  "Тип переменной"
label11  =  "Размер шрифта"
label15  =  "ID библиотеки шрифтов"
label7  =  "Цвет отображения"
label8  =  "Длина единиц измерения"
label10  =  "Выравнивание"
label2  =  "VP (0x)"
label4  =  "SP (0x)"
label16  =  "Имя"
label17  =  "Начальное значение"
TabText  =  "Отображение данных"
Text  =  "Отображение данных"
checkBox1  =  "Автоподбор межсимвольного интервала"
checkBox2  =  "Показывать незначащий ноль"
cbox_popshow  =  "показывать во всплывающем меню"

comboBox1String_1  =  "Слева"
comboBox1String_2  =  "Справа"
comboBox1String_3  =  "По центру"
Cb_vartypeString_1  =  "Int (2 байта)"
Cb_vartypeString_2  =  "Long int (4 байта)"
Cb_vartypeString_3  =  "*VP, старший байт"
Cb_vartypeString_4  =  "*VP, младший байт"
Cb_vartypeString_5  =  "Сверхдлинное int (8 байт)"
Cb_vartypeString_6  =  "Беззнаковое int (2 байта)"
Cb_vartypeString_7  =  "Беззнаковое long int (4 байта)"
Cb_vartypeString_8  =  "float（4 байта）"
Cb_vartypeString_9  =  "double（8 байт）"

//文本显示
[TextdisForm]
label3  =  "Цвет текста (0x)"
label12  =  "Кодировка"
label6  =  "ID шрифта для ASCII в кодировке"
label10  =  "ID шрифта для кодировок 0x00, 0x05 и \r\nне-ASCII в кодировках 0x01-0x04"
checkBox1  =  "Задать интервал между символами вручную"
label14  =  "Длина текста"
label13  =  "Интервал по вертикали"
label18  =  "Интервал по горизонтали"
label9  =  "Число точек по Y"
label11  =  "Число точек по X"
label16  =  "Имя"
label7  =  "SP (0x)"
label2  =  "VP (0x)"
label17  =  "Начальное значение"
Text  =  "Отображение текста"

cb_adjust  =  "подбор межсимвольного интервала"
label19  =  "по горизонтали"
label20  =  "по вертикали"
cbox_popshow  =  "показывать во всплывающем меню"

Cb_vartypeString_1  =  "0x00=8 бит"
Cb_vartypeString_2  =  "0x01=GB2312"
Cb_vartypeString_3  =  "0x02=GBK"
Cb_vartypeString_4  =  "0x03=BIG5"
Cb_vartypeString_5  =  "0x04=SJIS"
Cb_vartypeString_6  =  "0x05=UNICODE"

cb1_item0  =  "сверху"
cb1_item1  =  "по центру"

cb2_item0  =  "По левому краю"
cb2_item1  =  "По правому краю"
cb2_item2  =  "По центру"
cb2_item3  =  "Справа налево"

[DGUSTextdisForm]
label3  =  "Цвет текста (0x)"
label12  =  "Кодировка"
label6  =  "ID шрифта для ASCII в кодировке"
label10  =  "ID шрифта для кодировок 0x00, 0x05 и \r\nне-ASCII в кодировках 0x01-0x04"
checkBox1  =  "подбор межсимвольного интервала"
label14  =  "Длина текста"
label13  =  "Интервал по вертикали"
label18  =  "Интервал по горизонтали"
label9  =  "Выравнивание"
label11  =  "Число точек по X"
label16  =  "Имя"
label7  =  "SP (0x)"
label2  =  "VP (0x)"
label17  =  "Начальное значение"
Text  =  "Отображение текста"

cb_adjust  =  "без подбора межсимвольного интервала"
label19  =  "Масштаб текста"
label20  =  "по вертикали"
cbox_popshow  =  "показывать во всплывающем меню"

Cb_vartypeString_1  =  "0x00=8 бит"
Cb_vartypeString_2  =  "0x01=GB2312"
Cb_vartypeString_3  =  "0x02=GBK"
Cb_vartypeString_4  =  "0x03=BIG5"
Cb_vartypeString_5  =  "0x04=SJIS"
Cb_vartypeString_6  =  "0x05=UNICODE"

cb1_item0  =  "сверху"
cb1_item1  =  "по центру"

cb2_item0  =  "По левому краю"
cb2_item1  =  "По правому краю"
cb2_item2  =  "По центру"
cb2_item3  =  "Справа налево"
//表盘时钟设置
[ClockDis]
checkBox1  =  "Скрыть часовую стрелку"
label3  =  "Иконка часовой стрелки"
label11  =  "Координата центра"
label6  =  "Иконка минутной стрелки"
label5  =  "Координата центра"
checkBox2  =  "Скрыть минутную стрелку"
label12  =  "Иконка секундной стрелки"
label9  =  "Координата центра"
checkBox3  =  "Скрыть секундную стрелку"
label7  =  "Файл иконок"
label2  =  "Центр часов — координата\r\nлевого верхнего угла"
label4  =  "SP (0x)"
label16  =  "Имя"
Text  =  "Часы"



//RTC显示
[RTCDISForm]
checkBox1  =  "Показывать день недели"
label2  =  "Формат даты:"
label12  =  "Таблица кодов RTC:"
label18  =  "Строится из таблицы кодов RTC и символов ASCII"
label28  =  "Q"
label29  =  "Минуты"
label26  =  "H"
label27  =  "Часы"
label24  =  "D"
label25  =  "День"
label22  =  "M"
label23  =  "Месяц"
label20  =  "Y"
label21  =  "Год"
label19  =  "Код"
label8  =  "Описание"
label32  =  "W"
label33  =  "День недели"
label30  =  "S"
label31  =  "Секунды"
label6  =  "M-D W H:Q отображается как"
label7  =  "2017-10-01  12:00:00"
label14  =  "Y-M-D H:Q:S отображается как"
label13  =  "2017-10-01 12:00:00 Wednesday"
label10  =  "10-01 WED 12：00"
label9  =  "Допустим, время:"
label1  =  "SP (0x)"
label4  =  "SP (0x)"
label11  =  "Число точек по X"
label15  =  "ID библиотеки шрифтов"
label3  =  "Цвет шрифта"
label16  =  "Имя"
Text  =  "Отображение RTC"
checkBox2  =  "Автоподбор межсимвольного интервала"
//基本图形显示
[BaseGraphs]
label4  =  "VP (0x)"
label5  =  "SP (0x)"
label16  =  "Имя"
label8  =  "Команды сегментного рисования: 0x02, 0x03, 0x09, 0x0A\r\nсегмент будет показан пунктиром"
checkBox1  =  "Пунктир"
groupBox1  =  "Формат пунктира"
TabText  =  "Отображение базовой графики"


//特殊行业应用
[BaseApplyForm]
label2  =  "VP (0x)"
label3  =  "SP (0x)"
label16  =  "Имя"
TabText  =  "Специальные применения"

//QR code
[QRCodeForm]
label8  =  "Единица: пиксели"
label2  =  "VP (0x)"
label4  =  "SP (0x)"
label16  =  "Имя"
Text  =  "QR-код"

label12  =  "Режим размера"
label3  =  "цвет отображения"
label5  =  "фон"
label6  =  "QR"

cb1_item0  =  "чёрно-белый"
cb1_item1  =  "задаётся пользователем"
cb2_item0  =  "по размеру"
cb2_item1  =  "фиксированный 73*73"

//区域滚屏显示
[ZonescrollingForm]
label1  =  "SP (0x)"
label5  =  "Способ перемещения"
groupBox1  =  "Скорость прокрутки"
label8  =  "Смещение за цикл (пиксели)"
label2  =  "VP (0x)"
label4  =  "SP (0x)"
label16  =  "Имя"
TabText  =  "Бегущая зона"
comboBox2String_1  =  "Влево"
comboBox2String_2  =  "Вправо"
comboBox2String_3  =  "Вверх"
comboBox2String_4  =  "Вниз"

//数据窗口指示
[DataWindowForm]
groupBox1  =  "Режим отображения"
checkBox3  =  "Циклические данные"
checkBox2  =  "Показывать плюс (+)"
checkBox1  =  "Показывать незначащие"
label8  =  "Шаг"
label6  =  "Количество отображаемых данных"
label4  =  "Целых разрядов"
label5  =  "Дробных разрядов"
label1  =  "Верхний предел данных"
label11  =  "Нижний предел данных"
label16  =  "Имя"
label7  =  "SP (0x)"
label2  =  "VP (0x)"
groupBox2  =  "Характеристики данных"
groupBox4  =  "Выбранные данные"
label12  =  "Размер по Y"
label13  =  "Размер по X"
label14  =  "Цвет отображения"
groupBox3  =  "Невыбранные данные"
label10  =  "Размер по Y"
label9  =  "Размер по X"
label3  =  "Цвет отображения"
Text  =  "Окно данных"
checkBox4  =  "Автоподбор межсимвольного интервала"
label15  =  "Библиотека шрифтов"
//预览窗口
[PreviewForm]
label2  =  "Двойной щелчок по границе окна — выход"
label1  =  "виртуальный экран"
label5  =  "порт"
label6  =  "скорость"
btnOpen  =  "открыть"
btnFrmCom  =  "запись"
btnComSet  =  "настройка COM-порта"
btnDebug  =  "отладка"

//变量数据录入
[DGUSForm]
Dis_Pass  =  "При вводе показывать *"
label10  =  "Место отображения"
label9  =  "Область клавиатуры"
label8  =  "Текущая страница"
button1  =  "Задать"
button22  =  "Настройка клавиатуры"
label16  =  "Имя"
checkBox2  =  "Без эффекта кнопки"
button5  =  "задать"
label19  =  "Эффект кнопки:"
checkBox1  =  "Включить пределы"
label20  =  "Макс."
label17  =  "Мин."
checkBox3  =  "Автозагрузка данных"
checkNext  =  "Без переключения страницы"
label21  =  "Переключение страницы:"
button6  =  "задать"
checkBox4  =  "Загружать данные при вводе"
label26  =  "Загрузка данных"
label25  =  "Адрес данных (0x)"
label13  =  "Дробных разрядов"
label22  =  "Положение клавиатуры"
label2  =  "Способ отображения"
label15  =  "Цвет курсора"
label1  =  "Целых разрядов"
label7  =  "Размер шрифта"
label6  =  "ID шрифта"
label5  =  "Цвет отображения"
label4  =  "Место отображения"
label3  =  "Тип переменной"
label11  =  "VP (0x)"
label23  =  "Начальное значение"
TabText  =  "Ввод данных переменной"
Text  =  "Ввод данных переменной"
label24  =  "Прозрачность фона"
Cb_vartypeString_1  =  "Int (слово)"
Cb_vartypeString_2  =  "Long int (двойное слово)"
Cb_vartypeString_3  =  "Старший байт"
Cb_vartypeString_4  =  "Младший байт"
Cb_vartypeString_5  =  "Сверхдлинное int (8 байт)"
Cb_vartypeString_6  =  "float"
Cur_ColorString_1  =  "Чёрный"
Cur_ColorString_2  =  "Белый"
comboBox1String_1  =  "Показывать \'*\'"
comboBox1String_2  =  "Показывать напрямую"
comboPostioString_1  =  "Текущая страница"
comboPostioString_2  =  "Другая страница"
comboPostioString_3  =  "Конфигурация клавиатуры"

//弹出菜单配置
[PopMenuForm]
label11  =  "VP (0x)"
label3  =  "Тип переменной"
button1  =  "Настройка"
label10  =  "Место отображения"
label9  =  "Область меню"
button22  =  "Настройка всплывающего меню"
label8  =  "ID страницы"
label16  =  "Имя"
checkBox2  =  "Без эффекта кнопки"
label19  =  "Эффект кнопки:"
button5  =  "задать"
checkBox3  =  "Автозагрузка данных"
label6  =  "Номер бита (0x)"
radioButton4  =  "Бит"
radioButton3  =  "Младший байт"
radioButton2  =  "Старший байт"
radioButton1  =  "Int"
Text  =  "Конфигурация всплывающего меню"
label1  =  "Прозрачность фона"
//增量调节
[IncAdjustForm]
label11  =  "VP (0x)"
label3  =  "Тип переменной"
label16  =  "Имя"
checkBox2  =  "Без эффекта кнопки"
label19  =  "Эффект кнопки:"
button5  =  "задать"
checkBox3  =  "Автозагрузка данных"
label6  =  "Номер бита (0x)"
radioButton4  =  "Бит"
radioButton3  =  "Младший байт"
radioButton2  =  "Старший байт"
radioButton1  =  "Int"
label9  =  "Верхний предел"
label10  =  "Нижний предел"
label5  =  "Действие при выходе за предел"
label4  =  "Шаг регулировки"
label1  =  "Способ регулировки"
label7  =  "задержка (100 мс)"
label8  =  "Эффект касания"
TabText  =  "Пошаговая регулировка"
Cb_vartypeString_1  =  "Регулировка по байту"
Cb_vartypeString_2  =  "Регулировка старшего байта"
Cb_vartypeString_3  =  "Регулировка младшего байта"
comboBox2String_1  =  "Остановка"
comboBox2String_2  =  "Цикл"
comboBox3String_1  =  "Постоянная установка"
comboBox3String_2  =  "Разовая установка"


//拖动调节
[DragManagerForm]
groupBox1  =  "Режим перетаскивания"
label1  =  "Режим возврата данных"
label5  =  "Режим перетаскивания"
checkBox3  =  "Автозагрузка данных"
label9  =  "Конечное значение"
label10  =  "Начальное значение"
label16  =  "Имя"
label11  =  "VP (0x)"
label17  =  "Начальное значение"
TabText  =  "Регулировка перетаскиванием"
comboBox1String_1  =  "Int"
comboBox1String_2  =  "Старший байт"
comboBox1String_3  =  "Младший байт"
comboBox2String_1  =  "Горизонтально"
comboBox2String_2  =  "Вертикально"

//滑动图标选择
[PageDragManagerForm]
TabText  =  "иконка слайдера"
groupBox1  =  "режим слайдера"
label3  =  "Примечание: размер этого элемента должен совпадать с размером соответствующего элемента перехода страницы иконок."
label5  =  "режим слайдера"
label9  =  "скорость слайдера"
label10  =  "ID экрана"
label11  =  "VP(0x)"
label16  =  "имя"
checkBox3  =  "автозагрузка"
comboBox2String_1  =  "горизонтально"
comboBox2String_2  =  "вертикально"


//按键值返回配置
[TouchReturnForm]
button1  =  "задать"
button5  =  "задать"
label11  =  "VP (0x)"
label16  =  "Имя"
label5  =  "Способ сохранения возвращаемого значения"
label19  =  "Эффект кнопки:"
checkBox2  =  "Без эффекта кнопки"
checkBox1  =  "Без переключения страницы"
label1  =  "Переключение страницы:"
groupBox3  =  "Значение клавиши (0x)"
checkBox5  =  "Полная клавиатура QWER"
label6  =  "Номер бита"
radioButton4  =  "Бит"
radioButton3  =  "Младший байт"
radioButton2  =  "Старший байт"
radioButton1  =  "Int"
checkBox3  =  "Базовое касание"
checkBox4  =  "Автозагрузка данных"
Text  =  "Возврат кода клавиши"
label3  =  "Примечания:\r\n«Базовое касание» означает цифровую клавиатуру; задайте всем цифровым клавишам допустимые коды:\r\n0x0030-0x0039 (0-9), \r\n0x002E(.),\r\n0x002D(+/-),\r\n0x00F0(Отмена),\r\n0x00F1(Подтвердить/ОК),\r\n0x00F2(Backspace)."
label4  =  "Время удержания (ед.: 0,1 с):"

//ASCII录入
[TextInputForm]
label4  =  "Область отображения ввода"
button1  =  "Задать"
label10  =  "Место отображения"
label9  =  "Область клавиатуры"
button22  =  "Настройка клавиатуры"
label8  =  "ID страницы"
label16  =  "Имя"
button3  =  "Задать"
checkBox2  =  "Без эффекта кнопки"
button5  =  "задать"
label19  =  "Эффект кнопки:"
checkBox3  =  "Автозагрузка данных"
checkBox1  =  "Передавать значение при вводе"
checkNext  =  "Без переключения страницы"
label17  =  "Переключение страницы:"
button6  =  "задать"
label22  =  "Положение клавиатуры"
label20  =  "Высота шрифта"
label3  =  "Режим ввода"
label15  =  "Цвет курсора"
label1  =  "Длина текста"
label7  =  "Ширина шрифта"
label6  =  "ID библиотеки шрифтов"
label5  =  "Цвет шрифта"
label11  =  "VP (0x)"
label2  =  "Режим отображения"
Text  =  "Ввод текста ASCII"
label24  =  "Прозрачность фона"
label21  =  "Начальное значение"
Cur_ColorString_1  =  "Чёрный"
Cur_ColorString_2  =  "Белый"
comboBox1String_1  =  "Показывать напрямую"
comboBox1String_2  =  "Скрывать звёздочками (*)"
comboBox2String_1  =  "Ввод заново"
comboBox2String_2  =  "Правка текста"
comboPostionString_1  =  "Текущая страница"
comboPostionString_2  =  "Другие страницы"



//Parameter configuration
[ParamConfigForm]
button1  =  "задать"
button5  =  "задать"
label16  =  "Имя"
label19  =  "Эффект кнопки："
checkBox2  =  "Без эффекта кнопки"
checkBox1  =  "Без переключения страницы"
label1  =  "Переключение страницы："
checkBox4  =  "Автозагрузка данных"
Text  =  "Конфигурация параметров"

//同步数据返回
[K_DO_RETForm]
label16  =  "Имя"
checkBox2  =  "Без эффекта кнопки"
label19  =  "Эффект кнопки:"
button5  =  "задать"
groupBox5  =  "Отпускание"
label12  =  "Длина данных"
label15  =  "Режим"
groupBox4  =  "Непрерывное нажатие"
label8  =  "Длина данных"
label11  =  "Режим"
groupBox3  =  "Первое нажатие"
label7  =  "Длина данных"
label4  =  "Режим"
checkNext  =  "Без переключения страницы"
label1  =  "Переключение страницы:"
button1  =  "задать"
Text  =  "Возврат данных синхронизации"


//转动调节
[RotateadjustForm]
label16  =  "Имя"
checkBox2  =  "Без эффекта кнопки"
label19  =  "Эффект кнопки:"
button5  =  "задать"
label12  =  "Возвращаемое значение"
label11  =  "Возвращаемое значение"
label9  =  "A1 (конечный угол)"
label10  =  "A0 (начальный угол)"
label8  =  "R1 (внешний диаметр)"
label7  =  "Координата центра"
label5  =  "R0 (внутренний диаметр)"
label6  =  "VP (0x)"
label4  =  "Формат данных"
checkNext  =  "Без переключения страницы"
label1  =  "Переключение страницы:"
button1  =  "задать"
button3  =  "Задать"
Text  =  "Регулировка вращением"
comboBox1String_1  =  "0x00 （целое）"
comboBox1String_2  =  "0x01 （старший байт）"
comboBox1String_3  =  "0x02 （ младший байт）"

//滑动手势调节
[SwipeAdjustForm]
label5  =  "Режим слайдера"
label16  =  "Имя"
label11  =  "VP (0x)"
label17  =  "Чувствительность（1 — максимальная）"
checkBox3  =  "Автозагрузка данных"
label2  =  "Область регулировки"
TabText  =  "Регулировка слайдером"
comboBox2String_1  =  "Горизонтальное скольжение"
comboBox2String_2  =  "Вертикальное скольжение"


//滑动手势翻页
[SwipePageForm]
checkBox1  =  "Без следующей страницы"
label1  =  "Следующая страница:"
button1  =  "задать"
checkBox2  =  "Без предыдущей страницы"
label19  =  "Предыдущая страница:"
button5  =  "задать"
label16  =  "Имя"
label11  =  "VP (0x)"
label17  =  "Время"
checkBox3  =  "Автозагрузка данных"
groupBox3  =  "Чувствительность страницы"
(Distance/Time)
label3  =  "Расстояние"
label2  =  "Область регулировки"
TabText  =  "Листание страниц"
label4  =  "Автозагрузка ID страницы"
myGroupBox1  =  "Настройки завершающей анимации"
label6  =  "Скорость завершающей анимации"
label5  =  "Описание:\r\n 0x00: без завершающей анимации; \r\n другие значения: пиксели за период DGUS, рекомендуется горизонтальное разрешение, делённое на 20"
label7  =  "Режим скольжения"
cbox1_item0  =  "Горизонтально"
cbox1_item1  =  "Вертикально"



//迪文ICO文件预览
[frm_ICON_Sel]
toolStripButton1  =  "Открыть"
tbrname  =  "Перенумеровано"
toolStripButton2  =  "Назад"
toolStripButton3  =  "Далее"
toolStripButton4  =  "Создать ICO"
toolStripLabel1  =  "Выбор размера пикселей ICO-файла"
LabToICO  =  "Путь："
tabPage1  =  "Создание ICO-файла"
label4  =  "Путь к файлу："
grbDataSetting  =  " Настройка размера картинки"
toolStripDropDownButton2  =  "Настройка"
设置选择项ToolStripMenuItem  =  "Настроить выбранные"
设置所有ToolStripMenuItem  =  "Настроить все"
radioButton1  =  "Нумерация по имени файла"
lblWidth  =  "Ширина："
lblHeight  =  "Высота："
radioButton2  =  "Автонумерация по порядку файлов"
label6  =  "Напоминание："
label5  =  "Чтобы изменить или добавить \r\n картинку в ICO-файл, повторите \r\n первый и второй шаги"
label3  =  "Или"
label2  =  "Второй шаг："
button6  =  "Выбрать путь к файлам картинок"
button5  =  "Добавить в ICO-файл"
button1  =  "Создать новый ICO-файл"
label1  =  "Первый шаг ："
textBox1  =  "Поддерживаемые форматы： \"ICO\", \"JPG\", \"BMP\", \"GIF\", \"PNG\"\r\n------------------------\r\n если картинка больше 1023, она будет уменьшена до 1023*1023"
位置  =  "Позиция"
Column1  =  "Имя файла"
Column2  =  "Разрешение"
tabPage2  =  "Просмотр ICO-файла"
button8  =  "Отмена"
button7  =  "ОК"
checkBox1  =  "Фильтровать цвет фона"
button2  =  "Открыть файл"
button3  =  "Назад"
button4  =  "Далее"
dataGridViewTextBoxColumn1  =  "Позиция"
dataGridViewTextBoxColumn2  =  "Имя файла"
dataGridViewTextBoxColumn3  =  "Разрешение"
Text  =  "Просмотр ICO-файла Dwin"


//图片预览
[imgview]
button1  =  "ОК"
button2  =  "Отмена"
Text  =  "Просмотр картинки"

//查看地址设置
[PageSetForm]
label1  =  "Текущая страница ："
tabPage1  =  "Просмотр VP (0x)"
Text  =  "Просмотр адресов"


//显示区域
[TDocumentSpaceForm]
label2  =  "Сегмент"
checkBox2  =  "ID звука"
label1  =  "Значение (0x)"
checkBox1  =  "Код клавиши"
checkBox3  =  "Заблокирован"
String_1  =  "Ошибка открытия, импортируйте файл конфигурации или восстановите его"
String_2  =  "Настройка анимации"
String_3  =  "Иконка переменной"
String_4  =  "Базовое касание"
String_5  =  "Путь к проекту DGUS Tool:"
String_6  =  "Файл DWHMI (*.hmi)|*.hmi"
String_7  =  "Закрыть проект? Если «Да», изменения не будут сохранены"
String_8  =  "Напоминание"
String_9  =  "Библиотека шрифтов не найдена в [DWIN_SET] проекта, скопируйте файл библиотеки в [DWIN_SET]"
String_10  =  "Загрузка выполнена"
String_11  =  "Сохранено!"
String_12  =  "Генерация завершена. Файл HMIConfig.bin сохранён в текущем проекте"
String_13  =  "Нет настроек для генерации конфигурации"
String_14  =  "Удалить выбранную картинку?"
String_15  =  "Удалить все картинки?"
String_16  =  "Это последняя строка"
String_17  =  "Это последняя строка"
String_18  =  "Сначала добавьте картинки！"
String_19  =  "Выберите путь！"
String_20  =  "Картинки {0} и {1} называются одинаково, переименуйте их."
String_21  =  "Файл конфигурации успешно создан!"
String_22  =  "Ошибка генерации, проверьте количество элементов"
String_23  =  "Ошибка генерации, возможно, папка DWINSET доступна только для чтения"
String_24  =  "Ошибка генерации!"
String_25  =  "Картинка ["
String_26  =  " ] Конфигурации кнопок пересекаются, проверьте и повторите."
String_27  =  " На странице {0} неверно задан адрес переменной или начальное значение, проверьте"
String_28  =  "Ошибка экспорта, закройте Excel и повторите"
String_29  =  "Экспорт выполнен！"
String_30  =  "Файл конфигурации 13 не найден, выберите путь заново!"
String_31  =  "Файл конфигурации 14 не найден, выберите путь заново!"
String_32  =  "Откройте или создайте проект！"
String_33  =  "Нет картинок для просмотра: добавьте картинки в настройках, затем запустите просмотр"
String_34  =  "Сохранение проекта в новую папку возможно двумя способами: обычным и с поворотом на 90 градусов.\r\n \r\n 1. «Да» — проект будет сохранён в новую папку без изменений;\r\n 2. «Нет» — проект будет сохранён в новую папку с поворотом на 90 градусов.\r\n\r\n  Обработка занимает много времени, подождите..."
String_35  =  "Картинка"
String_36  =  "и"
String_37  =  "указатели описания картинок конфликтуют!"
String_38  =  "Пользовательское напоминание"
String_39=
String_40=
String_41=
String_42=
String_43=
String_44=
String_45=
String_46=
String_47=
String_48=
String_49=
String_50=

//多国语言
[MultiLanguage]
label1  =  "VP(0x)"
label3  =  "ID библиотеки："
label4  =  "мин. ID："
label5  =  "макс. ID："
label6  =  "SP(0x)"
frm_MultiLanguage  =  "мультиязычность"
cbox_GearEnable  =  "Регулировка передачи"
lbl_msg  =  "При переключении передач\r\nнужно задать указатель описания.\r\nЗапишите соответствующие верхний и нижний пределы\r\nпо адресу SP+0x05."

//旋钮屏
[RotaryKnob]
frm_RotaryKnob  =  "экран энкодера"
gb_effect  =  "Настройка эффекта выбора"
rbtn_VP  =  "VP"
rbtn_SP  =  "SP"
label19  =  "VP"
label7  =  "SP"
label1  =  "Тип"
controlTypeItem0  =  "иконка переменной"
controlTypeItem1  =  "художественный текст"
controlTypeItem2  =  "переменная данных"
label2  =  "мин."
label3  =  "макс."
label20  =  "начальный ID"
label21  =  "цвет"

gb_control  =  "функция"
rbtn_press  =  "нажатие"
rbtn_knob  =  "энкодер"
label23  =  "функция"
funcionItem0  =  "смена страницы"
funcionItem1  =  "вверх"
funcionItem2  =  "вниз"
label4  =  "страница"
label22  =  "связанный VP"
cbox_AutoUpdate  =  "автообновление VP"
cbox_LengthPress  =  "долгое нажатие"
cbox_OverBack  =  "возврат при превышении"
label5  =  "тип данных"
dataTypeItem0  =  "int"
dataTypeItem1  =  "long"
dataTypeItem2  =  "старший байт"
dataTypeItem3  =  "младший байт"
dataTypeItem4  =  "uint"
dataTypeItem5  =  "ulong"
dataTypeItem6  =  "float"
label6  =  "шаг"
label8  =  "макс."
label9  =  "мин."

label10  =  "энкодер"
knobModeItem0  =  "влево"
knobModeItem1  =  "вправо"
knobModeItem2  =  "влево и вправо"
label11  =  "функция"
function2Item0  =  "смена страницы"
function2Item1  =  "изменение данных"
label15  =  "ID левой"
label16  =  "ID правой"
cbox_AutoUpdate2  =  "автообновление VP"
cbox_IsOverBack2  =  "возврат при превышении"
label25  =  "связанный VP"
label12  =  "тип данных"
label14  =  "макс. VP"
label13  =  "мин. VP"
label17  =  "шаг влево"
label18  =  "шаг вправо"
cbox_pageChange  =  "Переход по страницам по значению VP"
label24  =  "начальная страница"

//旋钮屏设置
[FrmRotaryKnobSetting]
title  =  "настройка энкодера"
label1  =  "тип энкодера"
btnOk  =  "ОК"

//图标变量批量设置
[cfg_ICOvarForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox3  =  "Пределы переменной растут по порядку--"
checkBox2  =  "VP растёт по порядку--"
checkBox4  =  "Соответствующий ID иконки автоматически меняется вместе с пределами"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
checkBox5  =  "SP растёт по порядку--"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка иконок переменных"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "Файл иконок"
String_10  =  "Минимум"
String_11  =  "ID иконки"
String_12  =  "Максимум"
String_13  =  "ID иконки"
String_14  =  "Режим отображения"
String_15  =  "Прозрачный"
String_16  =  "Показывать фон"
String_17  =  "Начальное значение"
String_18  =  "Фильтр"

//ASCII录入批量设置
[cfg_AsciiInputForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox2  =  "VP растёт по порядку--"
checkBox3  =  "Цвет отображения"
button3  =  "задать"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Ввод ASCII"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка ввода ASCII"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "Автозагрузка данных"
String_6  =  "VP"
String_7  =  "0000"
String_8  =  "Эффект кнопки"
String_9  =  "Переключение страницы"
String_10  =  "Длина текста"
String_11  =  "Режим ввода"
String_12  =  "Ввод заново"
String_13  =  "Правка текста"
String_14  =  "ID библиотеки шрифтов"
String_15  =  "Ширина шрифта"
String_16  =  "Высота шрифта"
String_17  =  "Цвет курсора"
String_18  =  "Чёрный"
String_19  =  "Белый"
String_20  =  "Автозагрузка значения"
String_21  =  "Область отображения ввода"
String_22  =  "Режим отображения"
String_23  =  "Показывать напрямую"
String_24  =  "Скрывать звёздочками (*)"
String_25  =  "Положение клавиатуры"
String_26  =  "Текущая страница"
String_27  =  "Другие страницы"
String_28  =  "Всплывающее меню"
String_29  =  "Страницы"
String_30  =  "Область меню"
String_31  =  "Задать"
String_32  =  "Место отображения"


//基本触控批量设置
[cfg_BaseTouchForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox4  =  "Значение клавиши растёт по порядку  --"
button3  =  "задать"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Базовое касание"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка базового касания"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "Эффект кнопки"
String_6  =  "Переключение страницы"
String_7  =  "Значение клавиши"
String_8  =  "0000"



//QR code批量设置
[cfg_DimensionForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox3  =  "SP растёт по порядку--"
checkBox2  =  "VP растёт по порядку--"
button3  =  "задать эталон"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Настройка QR-кода"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка QR-кода"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "Единица: пиксели"

//数据显示量设置
[cfg_DisDataForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox4  =  "SP растёт по порядку--"
checkBox2  =  "VP растёт по порядку--"
checkBox3  =  "Цвет отображения"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Отображение данных"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка отображения данных"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "ID библиотеки шрифтов"
String_10  =  "Размер шрифта"
String_11  =  "Выравнивание"
String_12  =  "По левому краю"
String_13  =  "По правому краю"
String_14  =  "По центру"
String_15  =  "Тип переменной"
String_16  =  "0X00=Int (слово)"
String_17  =  "0X01=Long int (двойное слово)"
String_18  =  "0X02=*VP, старший байт"
String_19  =  "0X03=*VP, младший байт"
String_20  =  "0X04=Сверхдлинное int (8 байт)"
String_21  =  "0X05=Беззнаковое int (2 байта)"
String_22  =  "0X06=Беззнаковое int (4 байта)"
String_27  =  "0X07=float"
String_28  =  "0X08=double"
String_23  =  "Целых разрядов"
String_24  =  "Дробных разрядов"
String_25  =  "Показывать единицы"
String_26  =  "Начальное значение"

//文本显示批量设置
[cfg_DisTextForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox4  =  "SP растёт по порядку--"
checkBox2  =  "VP растёт по порядку--"
checkBox3  =  "Цвет отображения"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Отображение текста"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка отображения текста"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "Кодировка"
String_10  =  "0x00=8 бит"
String_11  =  "0x01=GB2312"
String_12  =  "0x02=GBK"
String_13  =  "0x03=BIG5"
String_14  =  "0x04=SJIS"
String_15  =  "0x05=UNICODE"
String_16  =  "Задать интервал между символами вручную"
String_17  =  "Длина текста"
String_18  =  "FONT0ID"
String_19  =  "ID шрифта для ASCII"
String_20  =  "FONT1ID"
String_21  =  "ID шрифта для остальных"
String_22  =  "Число точек по X"
String_23  =  "Число точек по Y"
String_24  =  "Интервал по горизонтали"
String_25  =  "Интервал по вертикали"
String_26  =  "Начальное значение"
String_27  =  "DWIN"
String_28  =  "Горизонтально"
String_29  =  "влево"
String_30  =  "вправо"
String_31  =  "по центру"
String_32  =  "справа налево"
String_33  =  "Вертикально"
String_34  =  "сверху"
String_35  =  "по центру"

//动画图标批量设置
[cfg_ICOAnimForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox3  =  "SP растёт по порядку--"
checkBox2  =  "VP растёт по порядку--"
checkBox4  =  "Цвет отображения"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Анимация иконок"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка анимации иконок"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "Файл иконок"
String_10  =  "Конечное значение"
String_11  =  "Начальное значение"
String_12  =  "ID конечной иконки"
String_13  =  "ID начальной иконки"
String_14  =  "ID конечной иконки"
String_15  =  "Режим отображения"
String_16  =  "Прозрачный"
String_17  =  "Показывать фон"
String_18  =  "Начальное значение"
String_19  =  "Фильтр"

//艺术字显示批量设置
[cfg_ICOArtForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox3  =  "SP по порядку--"
checkBox2  =  "VP растёт по порядку--"
checkBox4  =  "Цвет отображения"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Художественная переменная"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка художественных переменных"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "Файл иконок"
String_10  =  "Начальная иконка"
String_11  =  "Режим отображения"
String_12  =  "Прозрачный"
String_13  =  "Показывать фон"
String_14  =  "Тип переменной"
String_15  =  "Int (2 байта)"
String_16  =  "Long int (4 байта)"
String_17  =  "*VP, старший байт"
String_18  =  "*VP, младший байт"
String_19  =  "Сверхдлинное int (8 байт)"
String_20  =  "Беззнаковое int (2 байта)"
String_21  =  ""Беззнаковое long int (4 байта)6"
String_22  =  "Целых разрядов"
String_23  =  "Дробных разрядов"
String_24  =  "Выравнивание"
String_25  =  "По левому краю"
String_26  =  "По правому краю"
String_27  =  "Начальное значение"
String_28  =  "float, 4 байта"
String_29  =  "double, 8 байт"
String_30  =  "Фильтр"

//位变量图标批量设置
[cfg_ICOBitForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox3  =  "SP растёт по порядку--"
checkBox2  =  "VP растёт по порядку--"
checkBox4  =  "Цвет отображения"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Иконка битовой переменной"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка иконок битовых переменных"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "Режим отображения"
String_10  =  "Режим перемещения"
String_11  =  "Интервал перемещения"
String_12  =  "Настройка битового элемента"
String_13  =  "0000"
String_14  =  "Файл иконок"
String_15  =  "Показывать фон"
String_16  =  "Прозрачный"
String_17  =  "Показывать фон"
String_18  =  "AP"
String_19  =  "0000"
String_20  =  "Начальное значение"

//图片旋转批量设置
[cfg_ICORotationForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox3  =  "SP растёт по порядку--"
checkBox2  =  "VP растёт по порядку--"
checkBox4  =  "Цвет отображения"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Вращение иконки"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка вращения иконок"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "Файл иконок"
String_10  =  "ID иконки"
String_11  =  "Центр вращения иконки"
String_12  =  "Начальная  переменная"
String_13  =  "Конечная переменная"
String_14  =  "Начальный угол"
String_15  =  "Конечный угол"
String_16  =  "Режим отображения"
String_17  =  "Прозрачный"
String_18  =  "Показывать фон"
String_19  =  "Тип переменной"
String_20  =  "Int"
String_21  =  "старший байт"
String_22  =  "младший байт"
String_23  =  "Начальное значение"

//Sliding scale批量设置
[cfg_ICOSliderForm]
checkBox1  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox3  =  "SP растёт по порядку--"
checkBox2  =  "VP растёт по порядку--"
checkBox4  =  "Цвет отображения"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
label4  =  "Шкала слайдера"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка шкалы слайдера"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "SP"
String_6  =  "0000"
String_7  =  "VP"
String_8  =  "0000"
String_9  =  "Файл иконок"
String_10  =  "начальная переменная"
String_11  =  "конечная переменная"
String_12  =  "Иконка слайдера"
String_13  =  "Режим значений шкалы"
String_14  =  "Горизонтально"
String_15  =  "Вертикально"
String_16  =  "Смещение координаты вперёд"
String_17  =  "Режим отображения"
String_18  =  "Прозрачный"
String_19  =  "Показывать фон"
String_20  =  "Тип переменной"
String_21  =  "Int"
String_22  =  "старший байт"
String_23  =  "младший байт"
String_24  =  "Начальное значение"



//增量调节批量设置
[cfg_IncAdjustmentForm]
checkBox4  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox1  =  "Запись по байтам по порядку"
checkBox2  =  "VP растёт по порядку--"
label6  =  "Номер бита 0x"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
radioButton4  =  "Битовый элемент"
radioButton3  =  "младший байт"
radioButton2  =  "старший байт"
radioButton1  =  "Int"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка пошаговой регулировки"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "Автозагрузка данных"
String_6  =  "VP"
String_7  =  "0000"
String_8  =  "Эффект кнопки"
String_9  =  "Способ регулировки"
String_10  =  "Действие при выходе за предел"
String_11  =  "Остановка"
String_12  =  "Цикл"
String_13  =  "Шаг регулировки"
String_14  =  "Верхний предел"
String_15  =  "Нижний предел"
String_16  =  "Эффект касания"
String_17  =  "Постоянная установка"
String_18  =  "Разовая установка"





//弹出菜单批量设置
[cfg_PopMenuForm]
checkBox4  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox1  =  "Запись по байтам по порядку"
checkBox2  =  "VP растёт по порядку--"
label6  =  "Номер бита  0x"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
radioButton4  =  "Битовый элемент"
radioButton3  =  "младший байт"
radioButton2  =  "старший байт"
radioButton1  =  "Int"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка всплывающих меню"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "Автозагрузка данных"
String_6  =  "VP"
String_7  =  "0000"
String_8  =  "Эффект кнопки"
String_9  =  "Всплывающее меню"
String_10  =  "Страницы"
String_11  =  "Область меню"
String_12  =  "Настройка"
String_13  =  "Место отображения"


//按键返回批量设置
[cfg_ReKeyForm]
checkBox5  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox1  =  "Запись по байтам по порядку"
checkBox2  =  "VP растёт по порядку--"
label6  =  "Номер бита  0x"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
radioButton4  =  "Битовый элемент"
radioButton3  =  "младший байт"
radioButton2  =  "старший байт"
radioButton1  =  "Int"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка возврата данных"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "Автозагрузка данных"
String_6  =  "VP"
String_7  =  "0000"
String_8  =  "Эффект кнопки"
String_9  =  "Переключение страницы"
String_10  =  "Настройка значения клавиши"
String_11  =  "0000"


//拖动调节批量设置
[cfg_SliderAdjustForm]
checkBox5  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox1  =  "Запись по байтам по порядку"
checkBox2  =  "VP растёт по порядку--"
label6  =  "Запись в байт 0x"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
radioButton4  =  "Битовый элемент"
radioButton3  =  "Запись в младший байт"
radioButton2  =  "Запись в старший байт"
radioButton1  =  "Запись переменной по байтам"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка регулировки перетаскиванием"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "Автозагрузка данных"
String_6  =  "VP"
String_7  =  "0000"
String_8  =  "Начальное значение"
String_9  =  "Конечное значение"
String_10  =  "Режим перетаскивания"
String_11  =  "Режим возврата данных"
String_12  =  "Int"
String_13  =  "старший байт"
String_14  =  "младший байт"
String_15  =  "Режим"
String_16  =  "Горизонтально"
String_17  =  "Вертикально"


//变量数据录入批量设置
[cfg_VarinputForm]
checkBox5  =  "Выбрать все"
toolStripButton1  =  "Переместить вверх"
toolStripButton2  =  "Переместить вниз"
toolStripButton3  =  "Удалить"
toolStripButton4  =  "Обновить до выбранного состояния"
checkBox3  =  "Цвет отображения"
checkBox2  =  "VP растёт по порядку--"
label6  =  "Запись в байт 0x"
label8  =  "Порядок работы:\r\n1、Двойной щелчок по списку позволяет изменить имя кнопки касания; подтвердите изменение клавишей Enter\r\n2、При выборе в списке элемент выделяется и на экране дизайна, чтобы пользователь мог сопоставить их\r\n3、Кнопка «Массовое изменение» приводит свойства отмеченных в панели свойств пунктов к одному значению\r\n4、Кнопки «Вверх/Вниз» меняют порядок в списке; значения задаются в порядке списка"
radioButton4  =  "Битовый элемент"
radioButton3  =  "Запись в младший байт"
radioButton2  =  "Запись в старший байт"
radioButton1  =  "Запись переменной по байтам"
button2  =  "Выход"
button1  =  "Массовое изменение"
Text  =  "Массовая настройка ввода данных переменной"
String_1  =  "Настройка основных свойств"
String_2  =  "Менять или нет"
String_3  =  "Идентификатор"
String_4  =  "Настройка свойств"
String_5  =  "Автозагрузка данных"
String_6  =  "VP"
String_7  =  "0000"
String_8  =  "Эффект кнопки"
String_9  =  "Переключение картинок"
String_10  =  "Тип переменной"
String_11  =  "0X00=Int (слово)"
String_12  =  "0X01=Long int (двойное слово)"
String_13  =  "0X02=старший байт"
String_14  =  "0X03=младший байт"
String_15  =  "0X04=Сверхдлинное int (8 байт)"
String_16  =  "Целых разрядов"
String_17  =  "Дробных разрядов"
String_18  =  "Область отображения ввода"
String_19  =  "ID шрифта"
String_20  =  "Размер шрифта"
String_21  =  "Цвет курсора"
String_22  =  "Чёрный"
String_23  =  "Белый"
String_24  =  "Способ отображения ввода"
String_25  =  "Показывать '*'"
String_26  =  "Показывать напрямую"
String_27  =  "Положение клавиатуры"
String_28  =  "Текущая страница"
String_29  =  "Другие страницы"
String_30  =  "Всплывающее меню"
String_31  =  "Страницы"
String_32  =  "Область меню"
String_33  =  "Настройка"
String_34  =  "Место отображения"
String_35  =  "Включить пределы"
String_36  =  "Верхний предел"
String_37  =  "Нижний предел"
String_38  =  "Загружать данные при вводе"
String_39  =  "Адрес загрузки"
String_40  =  "0000"
String_41  =  "Загрузка данных"



//查找VP
[FrmFind]
btnFindAll  =  "Найти все"
btnFindNext  =  "Найти далее"
btnFindBefore  =  "Найти ранее"


